org-files/pagescreencasts.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
#+Title: Screencasts for the python track in Applied Economic Analysis
#+Author: Jan Boone
#+OPTIONS: toc:2 timestamp:nil toc:nil

*Under construction*


This page contains the screencasts for the course [[file:index.org::#python_track_AEA][AEA]]

#+TOC: headlines 2

* How are the screencasts supposed to help?
  :PROPERTIES:
  :ID:       how_are_screencasts_supposed_to_help
  :END:

We use [[https://github.com/janboone/applied-economics][this notebook]] for the course. The notebook is fairly self-explanatory, but you may get stuck with some of the questions. The screencasts are meant to help you along if you do not know how to proceed.

For students without a programming background (like most economics students) it can be intimidating or frustrating to start typing code. Reasons include not knowing how to do it perfectly or getting scared when there is an error message. Obviously, this is not necessary nor helpful when trying to learn a programming language. But the upshot is that some students do not try anything, sit back and type the correct answers when given to them. Needless to say, you do not learn how to program in Python by typing in the correct answers given in class.

Hence, the screencasts give you hints on how to finish the notebook but they do not give you step-by-step answers for each question. If you get stuck, ask us during the tutorials.

** Why are there screencasts?

The screencasts were initially developed because of the 2020 corona crisis where students were no longer able to come to the campus of Tilburg University. Now that we have them, we use them as complements to the classes taught.

** Suggested use of the screencasts

Just watching the screencasts is not going to be very useful for you. The best way to use them is as follows:

+ first read the relevant section in the notebook and try to solve the questions by yourself
+ if you manage to do so, you are done and there is no need to watch the screencast; if you do not manage to answer all the questions, you have the background for the screencast (which is rather short and does not motivate the underlying economic problem) and you know what issues to look for in the video
+ type along with what we do in the screencast. Pause the video if you need more time to type
+ experiment with the code that we give you in the video either during the video or after watching it; try different numerical values, use different syntax or a different library; if you get an error, google it to see what is going on etc.
+ in general, play around with the Python code; that is the best way to understand and learn the language

When you get an error message, here are some tips on how to deal with such messages. Also note that as the screencast is typed "live", so there will be error messages in the videos as well and you can see how we deal with these as we go along.

Python error messages:
+ start reading the error message at the end; hence scroll down in your notebook to see the last line of the error message. This will usually give a clue of what is happening
+ if you do not know what the last line means, use copy/paste to google it or go to [[https://stackoverflow.com/][stackoverflow]] directly
+ reading "upwards" from the last line, you can trace how the error was generated; that is, which parts of your code caused the error. 

** Prerequisite knowledge

*Economics*: this introduction to python is part of an MSc degree in Economics. Hence, we assume that you know what utility is and how utility (and producer surplus, if relevant)
adds up to welfare. You know how demand and supply curves are derived. What market power is, how a Cournot model is solved. Concepts like asymmetric information, adverse selection and moral hazard ring a bell. You know what risk is and how it can be measured. You know what the [[https://www.worldbank.org/][World Bank]] is, as later on we will use their data. You have done introductions to statistics and econometrics. Generally speaking, you understand the economics parts of the notebooks, though not necessarily their Python implementation.

*Python*: before you start with the notebook and the screencasts you need some basic knowledge of Python. You can use [[https://www.datacamp.com/][Datacamp]], [[https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-][Socratica]], or introduction videos to Python, numpy etc. from one of the big python conferences, like [[https://www.youtube.com/playlist?list=PLYx7XA2nY5GcDQblpQ_M1V3PQPoLWiDAC][SciPy 2019]] or [[https://www.youtube.com/playlist?list=PLPbTDk1hBo3xof51R8pk3kP1BVBuMYP9c][PyCon 2019]] or more recent events.

Things you should be familiar with is the syntax of Python (e.g. the role of spaces), how to import libraries (difference between ~import numpy as np, import numpy, from numpy import *~), how to define a function, use of datatypes like lists, tuples, dictionaries, ~numpy~ arrays (what is the difference between adding lists (using "+") and adding numpy arrays), you understand slicing notation for arrays and lists, the use of masks to select data from an array, you are able to plot a function or data points with ~matplotlib~, you can read data into a dataframe with ~pandas~ and then manipulate this data (define new columns/variables).

** Libraries we use regularly

+ numpy: basic number crunching and vector manipulation
+ pymc3: to generate random numbers and do Bayesian analysis
+ tensorflow (2.0 or later): to generate random numbers; here used mainly to "have seen it"; we use it more in a later course on data science
+ scipy: scientific python
+ matplotlib: to make plots

