pagescreencasts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Screencasts for Applied Economic Analysis</title>
<meta name="author" content="Jan Boone" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Screencasts for Applied Economic Analysis</h1>
<p>
<b>Under construction</b>
</p>


<p>
This page contains the screencasts for the course <a href="index.html#python_track_AEA">AEA</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9924ce4">How are the screencasts supposed to help?</a>
<ul>
<li><a href="#org9d1ec3e">Why are there screencasts?</a></li>
<li><a href="#org8c836ec">Suggested use of the screencasts</a></li>
<li><a href="#orgc8b2bf9">Prerequisite knowledge</a></li>
<li><a href="#org0df8cec">Libraries we use regularly</a></li>
</ul>
</li>
<li><a href="#Short_introduction_to_JupyterLab">Short introduction to JupyterLab</a>
<ul>
<li><a href="#org1e648e7">getting the repository in colab</a></li>
</ul>
</li>
<li><a href="#orgab6e6e8">Compare jupyter notebook/lab and emacs</a>
<ul>
<li><a href="#org941a8ef">Why am I using emacs</a></li>
<li><a href="#org59706c8">Jupyter vs Emacs</a></li>
</ul>
</li>
<li><a href="#org846bb18">The market</a>
<ul>
<li><a href="#org0d77618">why do we love the market?</a></li>
<li><a href="#orgff8d044">why do others not love the market?</a></li>
</ul>
</li>
<li><a href="#org984c9c7">Asymmetric information</a>
<ul>
<li><a href="#org7856768">adverse selection</a></li>
<li><a href="#org8f1c082">moral hazard</a></li>
</ul>
</li>
<li><a href="#org733ebe7">Financial crisis</a>
<ul>
<li><a href="#orgdf1a29e">why is there a problem in financial markets?</a></li>
<li><a href="#orga40f08c">why these bonus contracts?</a></li>
</ul>
</li>
<li><a href="#orgeb189b1">Using Python for empirical research</a>
<ul>
<li><a href="#org38a74f0">API's to get data</a></li>
<li><a href="#orgf9616ea">hacker statistics</a></li>
</ul>
</li>
<li><a href="#org8f6903a">Regulation in healthcare markets</a>
<ul>
<li><a href="#org629aa20">getting the data ready</a></li>
<li><a href="#org714862c">plot and model</a></li>
<li><a href="#upload_data_on_the_university_server">upload data on the university server</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9924ce4" class="outline-2">
<h2 id="org9924ce4">How are the screencasts supposed to help?</h2>
<div class="outline-text-2" id="text-org9924ce4">
<p>
We use <a href="https://github.com/janboone/applied-economics">this notebook</a> for the course. The notebook is fairly self-explanatory, but you may get stuck with some of the questions. The screencasts are meant to help you along if you do not know how to proceed.
</p>

<p>
For students without a programming background (like most economics students) it can be intimidating or frustrating to start typing code. Reasons include not knowing how to do it perfectly or getting scared when there is an error message. Obviously, this is not necessary nor helpful when trying to learn a programming language. But the upshot is that some students do not try anything, sit back and type the correct answers when given to them. Needless to say, you do not learn how to program in Python by typing in the correct answers given in class.
</p>

<p>
Hence, the screencasts give you hints on how to finish the notebook but they do not give you step-by-step answers for each question. If you get stuck, ask us during the tutorials.
</p>
</div>

<div id="outline-container-org9d1ec3e" class="outline-3">
<h3 id="org9d1ec3e">Why are there screencasts?</h3>
<div class="outline-text-3" id="text-org9d1ec3e">
<p>
The screencasts were initially developed because of the 2020 corona crisis where students were no longer able to come to the campus of Tilburg University. Now that we have them, we use them as complements to the classes taught.
</p>
</div>
</div>

<div id="outline-container-org8c836ec" class="outline-3">
<h3 id="org8c836ec">Suggested use of the screencasts</h3>
<div class="outline-text-3" id="text-org8c836ec">
<p>
Just watching the screencasts is not going to be very useful for you. The best way to use them is as follows:
</p>

<ul class="org-ul">
<li>first read the relevant section in the notebook and try to solve the questions by yourself</li>
<li>if you manage to do so, you are done and there is no need to watch the screencast; if you do not manage to answer all the questions, you have the background for the screencast (which is rather short and does not motivate the underlying economic problem) and you know what issues to look for in the video</li>
<li>type along with what we do in the screencast. Pause the video if you need more time to type</li>
<li>experiment with the code that we give you in the video either during the video or after watching it; try different numerical values, use different syntax or a different library; if you get an error, google it to see what is going on etc.</li>
<li>in general, play around with the Python code; that is the best way to understand and learn the language</li>
</ul>

<p>
When you get an error message, here are some tips on how to deal with such messages. Also note that as the screencast is typed "live", so there will be error messages in the videos as well and you can see how we deal with these as we go along.
</p>

<p>
Python error messages:
</p>
<ul class="org-ul">
<li>start reading the error message at the end; hence scroll down in your notebook to see the last line of the error message. This will usually give a clue of what is happening</li>
<li>if you do not know what the last line means, use copy/paste to google it or go to <a href="https://stackoverflow.com/">stackoverflow</a> directly</li>
<li>reading "upwards" from the last line, you can trace how the error was generated; that is, which parts of your code caused the error.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc8b2bf9" class="outline-3">
<h3 id="orgc8b2bf9">Prerequisite knowledge</h3>
<div class="outline-text-3" id="text-orgc8b2bf9">
<p>
<b>Economics</b>: this introduction to python is part of an MSc degree in Economics. Hence, we assume that you know what utility is and how utility (and producer surplus, if relevant)
adds up to welfare. You know how demand and supply curves are derived. What market power is, how a Cournot model is solved. Concepts like asymmetric information, adverse selection and moral hazard ring a bell. You know what risk is and how it can be measured. You know what the <a href="https://www.worldbank.org/">World Bank</a> is, as later on we will use their data. You have done introductions to statistics and econometrics. Generally speaking, you understand the economics parts of the notebooks, though not necessarily their Python implementation.
</p>

<p>
<b>Python</b>: before you start with the notebook and the screencasts you need some basic knowledge of Python. You can use <a href="https://www.datacamp.com/">Datacamp</a>, <a href="https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-">Socratica</a>, or introduction videos to Python, numpy etc. from one of the big python conferences, like <a href="https://www.youtube.com/playlist?list=PLYx7XA2nY5GcDQblpQ_M1V3PQPoLWiDAC">SciPy 2019</a> or <a href="https://www.youtube.com/playlist?list=PLPbTDk1hBo3xof51R8pk3kP1BVBuMYP9c">PyCon 2019</a> or more recent events.
</p>

<p>
Things you should be familiar with is the syntax of Python (e.g. the role of spaces), how to import libraries (difference between <code>import numpy as np, import numpy, from numpy import *</code>), how to define a function, use of datatypes like lists, tuples, dictionaries, <code>numpy</code> arrays (what is the difference between adding lists (using "+") and adding numpy arrays), you understand slicing notation for arrays and lists, the use of masks to select data from an array, you are able to plot a function or data points with <code>matplotlib</code>, you can read data into a dataframe with <code>pandas</code> and then manipulate this data (define new columns/variables).
</p>
</div>
</div>

<div id="outline-container-org0df8cec" class="outline-3">
<h3 id="org0df8cec">Libraries we use regularly</h3>
<div class="outline-text-3" id="text-org0df8cec">
<ul class="org-ul">
<li>numpy: basic number crunching and vector manipulation</li>
<li>pymc: to generate random numbers and do Bayesian analysis</li>
<li>tensorflow: to generate random numbers; here used mainly to "have seen it"; we use it more in a later course on data science</li>
<li>scipy: scientific python</li>
<li>matplotlib: to make plots</li>
</ul>
</div>
</div>
</div>
