org-files/pagescreencasts.org
* Short introduction to JupyterLab
  :PROPERTIES:
  :CUSTOM_ID: Short_introduction_to_JupyterLab
  :END:

You can use JupyterLab on the Tilburg University server. But you can also install it locally on your computer using the [[https://www.anaconda.com/products/individual][Anaconda distribution]]. The basics of the following introduction are the same in both cases (and for google colab).

The video was recorded using an older version of the website; but it will look similar in your year.

The goal of this video is to give you an introduction to JupyterLab; not an introduction to Python. So, do not worry if you do not understand (yet) the Python code that is typed and evaluated.

[[yt:EFOmmjnYGHs][Introduction to JupyterLab]]

Topics we cover in this video:
+ using ~git~ to "clone" the ~applied-economics~ repository on JupyterLab;
+ difference between a code cell and a markdown cell in a jupyter notebook;
+ you can use the menu at the top to switch between Markdown and Code;
+ you evaluate both a code cell and a markdown cell by pressing the SHIFT and ENTER keys at the same time;
+ if you want to edit an evaluated markdown cell, go to the cell and press ENTER; or double click on the cell with your mouse;
+ how to create headings (using ~#~) and bullet lists (using ~*~) in markdown;
+ create a link in markdown;
+ how to type math in markdown using [[https://www.latex-project.org/][latex]] and the delimiters ~$ $~
+ in a code cell, you can type Python code:
  + this can be useful if you want to make notes on your datacamp courses
  + type and evaluate the Python code (from datacamp) and explain what the code does in a markdown cell;
+ if you have long variable or function names, use the TAB key to complete the names;
+ this also works if you want to type functions associated with a library like ~numpy~
  + e.g.type ~np.ara~ and then TAB to see the completions;
+ apply the numpy ~sum~ function to an array ~my_list~: ~np.sum(my_list~) or ~my_list.sum()~
+ create a plot using ~matplotlib.pyplot~ and add labels to the axes, a title to the figure and a legend.
+ when you are finished with a notebook, you can close the file and do not forget to close the kernel as well (see the video on how to do this)
  + if you have too many kernel sessions running, you can run out of memory on the server meaning you cannot evaluate Python code anymore.

Questions you can try before continuing:
+ in a markdown cell, we can create $\alpha$ by typing latex ~$\alpha$~; now in a code cell type ~\alpha~ and then the TAB key; this gives you the /variable/ $\alpha$;
+ typing in a code cell $\alpha = 5$ gives this variable $\alpha$ the value 5;
+ plot the function $f(x)=x^3$ on the interval $[-1,1]$.

If you want to know more about the use of JupyterLab, there are a number of introductions to JupyterLab on the web. Here is one (start video at 9 minutes): https://www.youtube.com/watch?time_continue=152&v=Gzun8PpyBCo&feature=emb_logo

You can also google "jupyterlab introduction" and the [[https://jupyterlab.readthedocs.io/en/stable/][documentation]] can be useful as well.

** getting the repository in colab

If for some reason you would like to use the notebook on [[https://colab.research.google.com/notebooks/intro.ipynb#recent=true][google colab]] (e.g. because the university server is temporarily down), the following video shows how to import the applied economics repository into colab.

[[yt:LVt0yagCwD8]]

Topics we cover in the video:
+ go to google colab; then from the menu: File => Upload notebook
+ in pop-up window click on the GitHub tab and copy/paste the web address of the github repository that you would like to upload; in our case ~https://github.com/janboone/applied-economics~
+ if you want to install a new library in colab, e.g. wbdata, type ~!pip install wbdata~
+ install all libraries such that you can run the cell with import statements without errors

* Compare jupyter notebook/lab and emacs

** Why am I using emacs

As explained [[id:how_are_screencasts_supposed_to_help][above]], one of the worries is that students sit back and copy/paste whatever is done in the videos. To force them to make more of an effort, I do not use jupyter notebooks in the screencasts. Hence, a bit more "mental processing" is needed to follow along. This is also the reason that we do not publish the notebooks from the videos. Students need to type along with the video; not copy/paste from the final file.

Further, Emacs makes it easier to give a presentation in the screencast than jupyter notebooks, e.g. by folding sections that are finished and by giving completion on latex snippets.

** Jupyter vs Emacs

When you see me use Emacs in the videos, you can spot some differences with JupyterLab:
+ evaluating a code cell with Python in jupyter is done by pressing Shift-Enter (that is, press the Shift and Enter keys at the same time); in Emacs press C-c C-c (that is press Control and C simultaneously two times)
+ to get help on a function, type e.g. ~np.arange?~ in a code cell and evaluate the cell
+ to type text in a jupyter notebook, turn a code-cell into a Markdown cell; in Emacs you can simply type text
+ to create a new code cell in jupyter: press "a" (new cell above) or "b" (new cell below) when you do not have a cursor in the current cell (if you do have a cursor, first press the ESC key); in Emacs (and org-mode version >= 9.2) type C-c C-, and a menu will appear of block types (python, ipython, elisp etc.)
+ use the TAB key to complete function, variable etc. names. Works both in jupyter and Emacs
+ to get greek letters in a code block of a jupyter notebook, use the latex expression for the greek letter (without the delimiters ~$ $~) and type TAB; e.g.type ~\alpha~ and then press TAB
+ add ~%matplotlib inline~ after importing ~matplotlib.pyplot~ to get the figures in the notebook/file itself

* The market

** why do we love the market?

[[yt:naYoM7cezSE][Allocating goods to consumers]]

Topics we cover in this video:
+ optimal way to allocate a fixed number of products among a set of consumers
+ use of ~np.arange~ to generate a vector of numbers
+ ~np.random.normal~ and ~tf.random.normal~ to generate a vector of random numbers
+ sort a vector of numbers
+ use slicing to select a subset of entries in a vector $x$, e.g. ~x[:5]~
+ use ~format~ to format the output in a print statement
+ sum entries in a vector

Questions you should be able to answer before continuing:
+ what is the welfare maximizing way to allocate $m$ products among $n>m$ consumers?
+ how can you calculate the Lagrange multiplier in the optimization problem at the end of the video using python?
+ why do we get an error if we would use ~tf.random.normal(50,10,2)~? hint: use ~tf.random.normal?~

