pagescreencasts.html

<div id="outline-container-Short_introduction_to_JupyterLab" class="outline-2">
<h2 id="Short_introduction_to_JupyterLab">Short introduction to JupyterLab</h2>
<div class="outline-text-2" id="text-Short_introduction_to_JupyterLab">
<p>
You can use JupyterLab on the Tilburg University server. But you can also install it locally on your computer using the <a href="https://www.anaconda.com/products/individual">Anaconda distribution</a>. The basics of the following introduction are the same in both cases (and for google colab).
</p>

<p>
The video was recorded using an older version of the website; but it will look similar in your year.
</p>

<p>
The goal of this video is to give you an introduction to JupyterLab; not an introduction to Python. So, do not worry if you do not understand (yet) the Python code that is typed and evaluated.
</p>

<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/EFOmmjnYGHs" frameborder="0" allowfullscreen>Introduction to JupyterLab</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>using <code>git</code> to "clone" the <code>applied-economics</code> repository on JupyterLab;</li>
<li>difference between a code cell and a markdown cell in a jupyter notebook;</li>
<li>you can use the menu at the top to switch between Markdown and Code;</li>
<li>you evaluate both a code cell and a markdown cell by pressing the SHIFT and ENTER keys at the same time;</li>
<li>if you want to edit an evaluated markdown cell, go to the cell and press ENTER; or double click on the cell with your mouse;</li>
<li>how to create headings (using <code>#</code>) and bullet lists (using <code>*</code>) in markdown;</li>
<li>create a link in markdown;</li>
<li>how to type math in markdown using <a href="https://www.latex-project.org/">latex</a> and the delimiters <code>$ $</code></li>
<li>in a code cell, you can type Python code:
<ul class="org-ul">
<li>this can be useful if you want to make notes on your datacamp courses</li>
<li>type and evaluate the Python code (from datacamp) and explain what the code does in a markdown cell;</li>
</ul></li>
<li>if you have long variable or function names, use the TAB key to complete the names;</li>
<li>this also works if you want to type functions associated with a library like <code>numpy</code>
<ul class="org-ul">
<li>e.g.type <code>np.ara</code> and then TAB to see the completions;</li>
</ul></li>
<li>apply the numpy <code>sum</code> function to an array <code>my_list</code>: <code>np.sum(my_list</code>) or <code>my_list.sum()</code></li>
<li>create a plot using <code>matplotlib.pyplot</code> and add labels to the axes, a title to the figure and a legend.</li>
<li>when you are finished with a notebook, you can close the file and do not forget to close the kernel as well (see the video on how to do this)
<ul class="org-ul">
<li>if you have too many kernel sessions running, you can run out of memory on the server meaning you cannot evaluate Python code anymore.</li>
</ul></li>
</ul>

<p>
Questions you can try before continuing:
</p>
<ul class="org-ul">
<li>in a markdown cell, we can create \(\alpha\) by typing latex <code>$\alpha$</code>; now in a code cell type <code>\alpha</code> and then the TAB key; this gives you the <i>variable</i> \(\alpha\);</li>
<li>typing in a code cell \(\alpha = 5\) gives this variable \(\alpha\) the value 5;</li>
<li>plot the function \(f(x)=x^3\) on the interval \([-1,1]\).</li>
</ul>

<p>
If you want to know more about the use of JupyterLab, there are a number of introductions to JupyterLab on the web. Here is one (start video at 9 minutes): <a href="https://www.youtube.com/watch?time_continue=152&amp;v=Gzun8PpyBCo&amp;feature=emb_logo">https://www.youtube.com/watch?time_continue=152&amp;v=Gzun8PpyBCo&amp;feature=emb_logo</a>
</p>

<p>
You can also google "jupyterlab introduction" and the <a href="https://jupyterlab.readthedocs.io/en/stable/">documentation</a> can be useful as well.
</p>
</div>

<div id="outline-container-org1e648e7" class="outline-3">
<h3 id="org1e648e7">getting the repository in colab</h3>
<div class="outline-text-3" id="text-org1e648e7">
<p>
If for some reason you would like to use the notebook on <a href="https://colab.research.google.com/notebooks/intro.ipynb#recent=true">google colab</a> (e.g. because the university server is temporarily down), the following video shows how to import the applied economics repository into colab.
</p>

<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/LVt0yagCwD8" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in the video:
</p>
<ul class="org-ul">
<li>go to google colab; then from the menu: File =&gt; Upload notebook</li>
<li>in pop-up window click on the GitHub tab and copy/paste the web address of the github repository that you would like to upload; in our case <code>https://github.com/janboone/applied-economics</code></li>
<li>if you want to install a new library in colab, e.g. wbdata, type <code>!pip install wbdata</code></li>
<li>install all libraries such that you can run the cell with import statements without errors</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgab6e6e8" class="outline-2">
<h2 id="orgab6e6e8">Compare jupyter notebook/lab and emacs</h2>
<div class="outline-text-2" id="text-orgab6e6e8">
</div>
<div id="outline-container-org941a8ef" class="outline-3">
<h3 id="org941a8ef">Why am I using emacs</h3>
<div class="outline-text-3" id="text-org941a8ef">
<p>
As explained , one of the worries is that students sit back and copy/paste whatever is done in the videos. To force them to make more of an effort, I do not use jupyter notebooks in the screencasts. Hence, a bit more "mental processing" is needed to follow along. This is also the reason that we do not publish the notebooks from the videos. Students need to type along with the video; not copy/paste from the final file.
</p>

<p>
Further, Emacs makes it easier to give a presentation in the screencast than jupyter notebooks, e.g. by folding sections that are finished and by giving completion on latex snippets.
</p>
</div>
</div>

<div id="outline-container-org59706c8" class="outline-3">
<h3 id="org59706c8">Jupyter vs Emacs</h3>
<div class="outline-text-3" id="text-org59706c8">
<p>
When you see me use Emacs in the videos, you can spot some differences with JupyterLab:
</p>
<ul class="org-ul">
<li>evaluating a code cell with Python in jupyter is done by pressing Shift-Enter (that is, press the Shift and Enter keys at the same time); in Emacs press C-c C-c (that is press Control and C simultaneously two times)</li>
<li>to get help on a function, type e.g. <code>np.arange?</code> in a code cell and evaluate the cell</li>
<li>to type text in a jupyter notebook, turn a code-cell into a Markdown cell; in Emacs you can simply type text</li>
<li>to create a new code cell in jupyter: press "a" (new cell above) or "b" (new cell below) when you do not have a cursor in the current cell (if you do have a cursor, first press the ESC key); in Emacs (and org-mode version &gt;= 9.2) type C-c C-, and a menu will appear of block types (python, ipython, elisp etc.)</li>
<li>use the TAB key to complete function, variable etc. names. Works both in jupyter and Emacs</li>
<li>to get greek letters in a code block of a jupyter notebook, use the latex expression for the greek letter (without the delimiters <code>$ $</code>) and type TAB; e.g.type <code>\alpha</code> and then press TAB</li>
<li>add <code>%matplotlib inline</code> after importing <code>matplotlib.pyplot</code> to get the figures in the notebook/file itself</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org846bb18" class="outline-2">
<h2 id="org846bb18">The market</h2>
<div class="outline-text-2" id="text-org846bb18">
</div>
<div id="outline-container-org0d77618" class="outline-3">
<h3 id="org0d77618">why do we love the market?</h3>
<div class="outline-text-3" id="text-org0d77618">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/naYoM7cezSE" frameborder="0" allowfullscreen>Allocating goods to consumers</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>optimal way to allocate a fixed number of products among a set of consumers</li>
<li>use of <code>np.arange</code> to generate a vector of numbers</li>
<li><code>np.random.normal</code> and <code>tf.random.normal</code> to generate a vector of random numbers</li>
<li>sort a vector of numbers</li>
<li>use slicing to select a subset of entries in a vector \(x\), e.g. <code>x[:5]</code></li>
<li>use <code>format</code> to format the output in a print statement</li>
<li>sum entries in a vector</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what is the welfare maximizing way to allocate \(m\) products among \(n>m\) consumers?</li>
<li>how can you calculate the Lagrange multiplier in the optimization problem at the end of the video using python?</li>
<li>why do we get an error if we would use <code>tf.random.normal(50,10,2)</code>? hint: use <code>tf.random.normal?</code></li>
</ul>
</div>
