org-files/pagescreencasts.org
*** market outcome

 [[yt:8ywVw9lIMmM][Equilibrium price and welfare]]

 Topics we cover:
 + define a (demand) function
 + booleans False/True represented as 0/1 and can be summed
 + use of ~scipy~'s ~optimize.fsolve~ to find the zero of a function (if you want more information about this function, use ~sp.optimize.fsolve?~)
   + [[https://www.youtube.com/watch?v=KeRNoXWs_y0&t=2s][another example]] of the use of =fsolve=
   + if you are interested, see [[https://www.youtube.com/watch?v=_1bOzIYcDaA][this video]] on a comparison of =fsolve= and =root= to solve equations
 + use of ~lambda~ to create an anonymous function (i.e. function without a name)
 + plot the demand function with ~plt.plot~; use ~plt.vlines~ to plot a vertical line
 + instead of slicing, we used a boolean mask to select valuations which exceed the equilibrium ~price~: ~valuations[valuations>price]~

*** elastic demand and supply

 You should be able to do this section in the notebook yourself. If not, then check the videos above once more.

** why do others not love the market?

*** income distribution

[[yt:tyqtrIAx898][Income distribution]]

Topics we cover in this video:
+ multiply boolean masks (~afford~ and ~wtp~ in the video) to generate the AND condition: demand consists of people who are willing to pay price $p$ for the good AND who can afford to pay $p$.

Questions you should be able to answer:
+ show --using python-- that welfare in the market (~welfare_2~) is below the max. possible welfare
+ the assignment in the notebook: run the model with the income distribution two times and show that higher income inequality can lead to lower welfare in the market. That is, there is an efficiency argument for income redistribution in a market context.

*** market power

You should be able to do the market power section on your own. It shows a graph suggesting the monopoly price is lower than the perfect competition price. In this context this is simply wrong. The question is: what is wrong in the python code?

Hence, test parts of the code to understand where things are going wrong. To solve this problem, you may want to look at the function ~min~. That is, evaluate ~min?~ and e.g. ~min(3,8)~.

**** merger simulation

We split the merger simulation section into different subsections/videos.

***** Cournot

[[yt:LiOqDkj9wWw][Cournot]]

Topics we cover in the video:
+ define the reaction function in Python for a simple Cournot model
+ use ~sp.optimize.fminbound~ on "minus profits" because Python has no maximization routines
  + if you are interested: [[https://www.youtube.com/watch?v=2HMKU2nHAbE][more information]] on minimization in pyhton
+ use ~fsolve~ on the function ~fixed_point~ to find the equilibrium outcome (both firms have output equal to the optimal reaction to the other firm's output level)
+ this corresponds to the point where the reaction functions intersect in $(q_1,q_2)$ space

Questions you should be able to answer:
+ which of the two lines drawn in the video is the reaction function of firm 1?
+ show that the equilibrium outcome for the case where $c_1=0.1,c_2=0.2$ has $(q_1,q_2)= (0.33333333, 0.23333333)$

***** Pandas

[[yt:8nHpZ-1MidE][Pandas]]

Topics we cover in the video:
+ create a 2 dimensional vector with draws from a normal distribution; note that in the notebook you only need a 1 dimensional draw (for the merged firm's cost level)
  + the rows are states of the world, the first column is firm 1's cost level, the second column firm 2's costs
+ create a Pandas dataframe with ~pd.DataFrame~ and a dictionary of the form: ~{'column name': vector with values}~
+ define new columns in the dataframe
+ two ways you can refer to a column in a dataframe: e.g. ~df.Q~ and ~df['Q']~; note that you cannot use the former if there are spaces in the column name

Questions you should be able to answer:
+ instead of defining ~q1,q2~ separately, define the vector ~q~ as follows and use this vector to create the dataframe ~df~ (hint: use ~q.shape~)
#+begin_src
costs = tf.random.normal([50,2],0.2,0.05).numpy()
q = np.array([sp.optimize.fsolve(lambda x: fixed_point(x,costs[i]),[0,0]) for i in range(50)])
#+end_src

***** OPTIONAL: Cournot with variable $n$

This section is optional. If this is your first Python course, skip this section for now (and come back to it later).

[[yt:xyaXz2L1F_Q][Optional Cournot video]]

In our previous Cournot model (and in the notebook), we defined the function ~reaction~ in such a way that it is specific to the number of firms in the market. This video introduces a function reaction that is more general. It makes the code more readable but also a bit more complicated.

If you want to take this a step further, look at [[https://numpy.org/doc/stable/reference/generated/numpy.vectorize.html?highlight=vectorize#numpy.vectorize][numpy's vectorize.]]

Topic we cover:
+ ~np.zeros_like(c)~ for an array ~c~

Questions you should be able to answer:
+ predict/explain what is printed if you evaluate the following code block:
#+begin_src
i = 3
mask = np.arange(6) != i
print(mask)
print(np.arange(6)[mask])
print(np.sum(np.arange(6)[mask]))
#+end_src


*** external effects

This section you should be able to do on your own. If not, watch again the video's above.

It provides another reason why markets may not generate max. welfare in the real world.

* Asymmetric information

Here we consider two standard forms of asymmetric information: adverse selection and moral hazard.

** adverse selection

[[yt:GeVGCJmq9PE]]

Topics we cover in the video:
+ drawing samples from a uniform distribution
+ in jupyter notebook/lab you can introduce a greek letter, say $\rho$, by typing ~\rho~ and then the TAB key
+ selecting the last, say 3 elements from a vector $x$ by slicing: ~x[-3:]~
+ downward sloping supply curve in a perfectly competitive insurance market

Questions you should be able to answer:
+ the assignment in the adverse selection section in the notebook: the effect of income on insurance demand

