pagescreencasts.html

<div id="outline-container-org9ea3a52" class="outline-4">
<h4 id="org9ea3a52">market outcome</h4>
<div class="outline-text-4" id="text-org9ea3a52">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/8ywVw9lIMmM" frameborder="0" allowfullscreen>Equilibrium price and welfare</iframe>
</p>

<p>
Topics we cover:
</p>
<ul class="org-ul">
<li>define a (demand) function</li>
<li>booleans False/True represented as 0/1 and can be summed</li>
<li>use of <code>scipy</code>'s <code>optimize.fsolve</code> to find the zero of a function (if you want more information about this function, use <code>sp.optimize.fsolve?</code>)
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=KeRNoXWs_y0&amp;t=2s">another example</a> of the use of <code>fsolve</code></li>
<li>if you are interested, see <a href="https://www.youtube.com/watch?v=_1bOzIYcDaA">this video</a> on a comparison of <code>fsolve</code> and <code>root</code> to solve equations</li>
</ul></li>
<li>use of <code>lambda</code> to create an anonymous function (i.e. function without a name)</li>
<li>plot the demand function with <code>plt.plot</code>; use <code>plt.vlines</code> to plot a vertical line</li>
<li>instead of slicing, we used a boolean mask to select valuations which exceed the equilibrium <code>price</code>: <code>valuations[valuations&gt;price]</code></li>
</ul>
</div>
</div>

<div id="outline-container-orge3c5f49" class="outline-4">
<h4 id="orge3c5f49">elastic demand and supply</h4>
<div class="outline-text-4" id="text-orge3c5f49">
<p>
You should be able to do this section in the notebook yourself. If not, then check the videos above once more.
</p>
</div>
</div>
</div>

<div id="outline-container-orgff8d044" class="outline-3">
<h3 id="orgff8d044">why do others not love the market?</h3>
<div class="outline-text-3" id="text-orgff8d044">
</div>
<div id="outline-container-org4af5d5b" class="outline-4">
<h4 id="org4af5d5b">income distribution</h4>
<div class="outline-text-4" id="text-org4af5d5b">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/tyqtrIAx898" frameborder="0" allowfullscreen>Income distribution</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>multiply boolean masks (<code>afford</code> and <code>wtp</code> in the video) to generate the AND condition: demand consists of people who are willing to pay price \(p\) for the good AND who can afford to pay \(p\).</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>show &#x2013;using python&#x2013; that welfare in the market (<code>welfare_2</code>) is below the max. possible welfare</li>
<li>the assignment in the notebook: run the model with the income distribution two times and show that higher income inequality can lead to lower welfare in the market. That is, there is an efficiency argument for income redistribution in a market context.</li>
</ul>
</div>
</div>

<div id="outline-container-orga3080e8" class="outline-4">
<h4 id="orga3080e8">market power</h4>
<div class="outline-text-4" id="text-orga3080e8">
<p>
You should be able to do the market power section on your own. It shows a graph suggesting the monopoly price is lower than the perfect competition price. In this context this is simply wrong. The question is: what is wrong in the python code?
</p>

<p>
Hence, test parts of the code to understand where things are going wrong. To solve this problem, you may want to look at the function <code>min</code>. That is, evaluate <code>min?</code> and e.g. <code>min(3,8)</code>.
</p>
</div>

<div id="outline-container-org2982a4f" class="outline-5">
<h5 id="org2982a4f">merger simulation</h5>
<div class="outline-text-5" id="text-org2982a4f">
<p>
We split the merger simulation section into different subsections/videos.
</p>
</div>

<ul class="org-ul">
<li><a id="org3f7e259"></a>Cournot<br />
<div class="outline-text-6" id="text-org3f7e259">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/LiOqDkj9wWw" frameborder="0" allowfullscreen>Cournot</iframe>
</p>

<p>
Topics we cover in the video:
</p>
<ul class="org-ul">
<li>define the reaction function in Python for a simple Cournot model</li>
<li>use <code>sp.optimize.fminbound</code> on "minus profits" because Python has no maximization routines
<ul class="org-ul">
<li>if you are interested: <a href="https://www.youtube.com/watch?v=2HMKU2nHAbE">more information</a> on minimization in pyhton</li>
</ul></li>
<li>use <code>fsolve</code> on the function <code>fixed_point</code> to find the equilibrium outcome (both firms have output equal to the optimal reaction to the other firm's output level)</li>
<li>this corresponds to the point where the reaction functions intersect in \((q_1,q_2)\) space</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>which of the two lines drawn in the video is the reaction function of firm 1?</li>
<li>show that the equilibrium outcome for the case where \(c_1=0.1,c_2=0.2\) has \((q_1,q_2)= (0.33333333, 0.23333333)\)</li>
</ul>
</div>
</li>

<li><a id="org3adaabe"></a>Pandas<br />
<div class="outline-text-6" id="text-org3adaabe">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/8nHpZ-1MidE" frameborder="0" allowfullscreen>Pandas</iframe>
</p>

<p>
Topics we cover in the video:
</p>
<ul class="org-ul">
<li>create a 2 dimensional vector with draws from a normal distribution; note that in the notebook you only need a 1 dimensional draw (for the merged firm's cost level)
<ul class="org-ul">
<li>the rows are states of the world, the first column is firm 1's cost level, the second column firm 2's costs</li>
</ul></li>
<li>create a Pandas dataframe with <code>pd.DataFrame</code> and a dictionary of the form: <code>{'column name': vector with values}</code></li>
<li>define new columns in the dataframe</li>
<li>two ways you can refer to a column in a dataframe: e.g. <code>df.Q</code> and <code>df['Q']</code>; note that you cannot use the former if there are spaces in the column name</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>instead of defining <code>q1,q2</code> separately, define the vector <code>q</code> as follows and use this vector to create the dataframe <code>df</code> (hint: use <code>q.shape</code>)</li>
</ul>
<pre class="example">
costs = tf.random.normal([50,2],0.2,0.05).numpy()
q = np.array([sp.optimize.fsolve(lambda x: fixed_point(x,costs[i]),[0,0]) for i in range(50)])
</pre>
</div>
</li>

<li><a id="orgcfebbb8"></a>OPTIONAL: Cournot with variable \(n\)<br />
<div class="outline-text-6" id="text-orgcfebbb8">
<p>
This section is optional. If this is your first Python course, skip this section for now (and come back to it later).
</p>

<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/xyaXz2L1F_Q" frameborder="0" allowfullscreen>Optional Cournot video</iframe>
</p>

<p>
In our previous Cournot model (and in the notebook), we defined the function <code>reaction</code> in such a way that it is specific to the number of firms in the market. This video introduces a function reaction that is more general. It makes the code more readable but also a bit more complicated.
</p>

<p>
If you want to take this a step further, look at <a href="https://numpy.org/doc/stable/reference/generated/numpy.vectorize.html?highlight=vectorize#numpy.vectorize">numpy's vectorize.</a>
</p>

<p>
Topic we cover:
</p>
<ul class="org-ul">
<li><code>np.zeros_like(c)</code> for an array <code>c</code></li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>predict/explain what is printed if you evaluate the following code block:</li>
</ul>
<pre class="example">
i = 3
mask = np.arange(6) != i
print(mask)
print(np.arange(6)[mask])
print(np.sum(np.arange(6)[mask]))
</pre>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org85dedd0" class="outline-4">
<h4 id="org85dedd0">external effects</h4>
<div class="outline-text-4" id="text-org85dedd0">
<p>
This section you should be able to do on your own. If not, watch again the video's above.
</p>

<p>
It provides another reason why markets may not generate max. welfare in the real world.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org984c9c7" class="outline-2">
<h2 id="org984c9c7">Asymmetric information</h2>
<div class="outline-text-2" id="text-org984c9c7">
<p>
Here we consider two standard forms of asymmetric information: adverse selection and moral hazard.
</p>
</div>

<div id="outline-container-org7856768" class="outline-3">
<h3 id="org7856768">adverse selection</h3>
<div class="outline-text-3" id="text-org7856768">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/GeVGCJmq9PE" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in the video:
</p>
<ul class="org-ul">
<li>drawing samples from a uniform distribution</li>
<li>in jupyter notebook/lab you can introduce a greek letter, say \(\rho\), by typing <code>\rho</code> and then the TAB key</li>
<li>selecting the last, say 3 elements from a vector \(x\) by slicing: <code>x[-3:]</code></li>
<li>downward sloping supply curve in a perfectly competitive insurance market</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>the assignment in the adverse selection section in the notebook: the effect of income on insurance demand</li>
</ul>
</div>
</div>
