org-files/pagescreencasts.org
** moral hazard

[[yt:saST6igsR6Y]]

Topics we cover in the video:
+ we use ~pymc3~ for random draws from a log-normal distribution 
+ the government maximizes welfare over marginal tax rates $\tau$ while each agent in the economy maximizes work effort for a given $\tau$
  + we have an optimization problem "over" optimization problems

Questions you should be able to answer:
+ what will be the optimal tax rate with $\rho=1$ (you will verify this in the notebook)
+ the assignment in the moral hazard section in the notebook: use Rawls' criterion as welfare function for the government

* Financial crisis

** why is there a problem in financial markets?


[[yt:petP6Bdf8Pk]]

Topics we cover in this video:
+ limited liability
+ relu activation function
+ first mention of "broadcasting" (but no need to understand it)
+ draw two dimensional array (that is a matrix) from a normal distribution
+ we calculate the mean across the rows of a two dimensional array with ~axis=0~; ~axis=1~ calculates the mean across columns

Question you should be able to answer:
+ rewrite the code with the relu function for the case where the firm has equity equal to 10; your plot should be the same as the one in the notebook with ~equity=10~.

** why these bonus contracts?

[[yt:-BzxZU8f1pU]]

Topics we cover in this video:
+ for the derivation of some results we use [[https://www.gnu.org/software/emacs/manual/html_mono/calc.html][Emacs calc]]; you do not need to know how this works, but you should be able to replicate the derivations
+ if you want to do symbolic math yourself on the computer, you can consider using [[https://www.sympy.org/en/index.html][SymPy]] in a jupyter notebook but we do not cover SymPy in this course

Questions you should be able to answer:
+ the video covers the second subsection of "why these bonus contracts?" in the notebook; you should be able to cover the first subsection "moral hazard"
+ the second subsection "moral hazard and adverse selection" defines the function ~profit~ in a different way; you should be able to follow what it does and plot the probability of the average outcome ($q$) against the top trader's outside option.
+ as the outside option for the top trader (high type) increases, why does the bank not increase $w$ and $b$ in such a way that $R=w/b$ remains constant? Then risk taking by the top trader would be unaffected. Why would this be (too) expensive for the bank?

* Using Python for empirical research

** API's to get data

[[yt:pstyrBrwXqw]]

Topics we cover in this video:
+ use of API [[https://wbdata.readthedocs.io/en/stable/][wbdata]] to access World Bank's databases
+ use of ~wb.search_indicators~ to find indicators on a certain topic
+ create a dictionary of indicators and column names and then download these data into a pandas' dataframe
+ we do this for two sets of indicators and then use ~pd.merge~ to merge these dataframes

Questions you should be able to answer:
+ use ~pd.merge?~ to find out what ~how~ and ~suffixes~ can do in a ~pd.merge~ statement
+ use the wbdata documentation to find the different themes on which the World bank has data

** hacker statistics

*** high school puzzles

[[yt:s1stRzO8a0Q]]

Topics we cover in this video:
+ program a statistical problem with coin throws in python
+ repeat this 10,000 times to see what the properties are of such an experiment

Questions you should be able to answer:
+ program the experiment with a dark cupboard containing 6 red socks and 14 blue socks. You randomly draw 2 socks (without replacement) from the cupboard. What is the probability that you draw two matching socks from the cupboard? Note that this you can calculate yourself, so you can check whether your code gives the right answer: $\frac{6}{20} \frac{5}{19} + \frac{14}{20} \frac{13}{19}$
+ solve this section in the notebook: which of the two experiments lasts longer on average? Why?

*** statistics

[[yt:aaDtTmNlWiY]]

Topics we cover in this video:
+ distribution and standard deviation of a sample mean
+ simulating a hypothesis test

Questions you should be able to answer:
+ what is the "statistical name" for ~np.std(mus)~ in the video?
+ what is the idea behind the hypothesis test in the video?
+ finish the statistics section in the notebook


* Regulation in healthcare markets

In this lecture we analyze Dutch healthcare data from [[https://www.vektis.nl/open-data][Vektis]] using ~pandas~, ~matplotlib~ and ~pymc3~.

** getting the data ready

[[yt:X6XNd2NaBpg]]

Topics we cover in this video:
+ importing data directly from the web using ~urllib;~
  + see subsection [[#upload_data_on_the_university_server][upload data on the university server]] below to see how to get your data on the university server when using JupyterLab;
+ how to read in a csv file as a dataframe using ~pd.read_csv()~;
+ how to rename columns in a pandas' dataframe using a dictionary;
+ how create a new column/variable which equals the sum of a list of columns;
+ using ~axis~ to specify whether an action is supposed to be applied across rows (~axis=0~) or columns (~axis=1~);
+ using ~df.replace()~ to replace values in a dataframe, again using a dictionary;
+ change the type of a column/variable using ~.astype();~
  - depending on the versions of the packages you are using ~df['age'].astype(int)~ can give an error
  - if this happens, use ~df['age'].astype("Float64").astype(int)~ instead;
+ using ~numpy~ functions on columns;
+ using a ~groupby~ to aggregate data to the level specified by the list of columns in the groupby
  + in the video we aggregate to age/gender categories, aggregating over postal-code observations.

Questions you should be able to answer:
+ what is the average expenditure (not log expenditure) across ages and postal codes for men and women?
+ what is the average expenditure per age category (across gender and postal codes)?

