pagescreencasts.html

<div id="outline-container-org8f1c082" class="outline-3">
<h3 id="org8f1c082">moral hazard</h3>
<div class="outline-text-3" id="text-org8f1c082">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/saST6igsR6Y" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in the video:
</p>
<ul class="org-ul">
<li>we use <code>pymc3</code> for random draws from a log-normal distribution</li>
<li>the government maximizes welfare over marginal tax rates \(\tau\) while each agent in the economy maximizes work effort for a given \(\tau\)
<ul class="org-ul">
<li>we have an optimization problem "over" optimization problems</li>
</ul></li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>what will be the optimal tax rate with \(\rho=1\) (you will verify this in the notebook)</li>
<li>the assignment in the moral hazard section in the notebook: use Rawls' criterion as welfare function for the government</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org733ebe7" class="outline-2">
<h2 id="org733ebe7">Financial crisis</h2>
<div class="outline-text-2" id="text-org733ebe7">
</div>
<div id="outline-container-orgdf1a29e" class="outline-3">
<h3 id="orgdf1a29e">why is there a problem in financial markets?</h3>
<div class="outline-text-3" id="text-orgdf1a29e">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/petP6Bdf8Pk" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>limited liability</li>
<li>relu activation function</li>
<li>first mention of "broadcasting" (but no need to understand it)</li>
<li>draw two dimensional array (that is a matrix) from a normal distribution</li>
<li>we calculate the mean across the rows of a two dimensional array with <code>axis=0</code>; <code>axis=1</code> calculates the mean across columns</li>
</ul>

<p>
Question you should be able to answer:
</p>
<ul class="org-ul">
<li>rewrite the code with the relu function for the case where the firm has equity equal to 10; your plot should be the same as the one in the notebook with <code>equity=10</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orga40f08c" class="outline-3">
<h3 id="orga40f08c">why these bonus contracts?</h3>
<div class="outline-text-3" id="text-orga40f08c">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/-BzxZU8f1pU" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>for the derivation of some results we use <a href="https://www.gnu.org/software/emacs/manual/html_mono/calc.html">Emacs calc</a>; you do not need to know how this works, but you should be able to replicate the derivations</li>
<li>if you want to do symbolic math yourself on the computer, you can consider using <a href="https://www.sympy.org/en/index.html">SymPy</a> in a jupyter notebook but we do not cover SymPy in this course</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>the video covers the second subsection of "why these bonus contracts?" in the notebook; you should be able to cover the first subsection "moral hazard"</li>
<li>the second subsection "moral hazard and adverse selection" defines the function <code>profit</code> in a different way; you should be able to follow what it does and plot the probability of the average outcome (\(q\)) against the top trader's outside option.</li>
<li>as the outside option for the top trader (high type) increases, why does the bank not increase \(w\) and \(b\) in such a way that \(R=w/b\) remains constant? Then risk taking by the top trader would be unaffected. Why would this be (too) expensive for the bank?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeb189b1" class="outline-2">
<h2 id="orgeb189b1">Using Python for empirical research</h2>
<div class="outline-text-2" id="text-orgeb189b1">
</div>
<div id="outline-container-org38a74f0" class="outline-3">
<h3 id="org38a74f0">API's to get data</h3>
<div class="outline-text-3" id="text-org38a74f0">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/pstyrBrwXqw" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use of API <a href="https://wbdata.readthedocs.io/en/stable/">wbdata</a> to access World Bank's databases</li>
<li>use of <code>wb.search_indicators</code> to find indicators on a certain topic</li>
<li>create a dictionary of indicators and column names and then download these data into a pandas' dataframe</li>
<li>we do this for two sets of indicators and then use <code>pd.merge</code> to merge these dataframes</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>use <code>pd.merge?</code> to find out what <code>how</code> and <code>suffixes</code> can do in a <code>pd.merge</code> statement</li>
<li>use the wbdata documentation to find the different themes on which the World bank has data</li>
</ul>
</div>
</div>

<div id="outline-container-orgf9616ea" class="outline-3">
<h3 id="orgf9616ea">hacker statistics</h3>
<div class="outline-text-3" id="text-orgf9616ea">
</div>
<div id="outline-container-org0bacdf3" class="outline-4">
<h4 id="org0bacdf3">high school puzzles</h4>
<div class="outline-text-4" id="text-org0bacdf3">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/s1stRzO8a0Q" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>program a statistical problem with coin throws in python</li>
<li>repeat this 10,000 times to see what the properties are of such an experiment</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>program the experiment with a dark cupboard containing 6 red socks and 14 blue socks. You randomly draw 2 socks (without replacement) from the cupboard. What is the probability that you draw two matching socks from the cupboard? Note that this you can calculate yourself, so you can check whether your code gives the right answer: \(\frac{6}{20} \frac{5}{19} + \frac{14}{20} \frac{13}{19}\)</li>
<li>solve this section in the notebook: which of the two experiments lasts longer on average? Why?</li>
</ul>
</div>
</div>

<div id="outline-container-orgdafee19" class="outline-4">
<h4 id="orgdafee19">statistics</h4>
<div class="outline-text-4" id="text-orgdafee19">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/aaDtTmNlWiY" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>distribution and standard deviation of a sample mean</li>
<li>simulating a hypothesis test</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>what is the "statistical name" for <code>np.std(mus)</code> in the video?</li>
<li>what is the idea behind the hypothesis test in the video?</li>
<li>finish the statistics section in the notebook</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org8f6903a" class="outline-2">
<h2 id="org8f6903a">Regulation in healthcare markets</h2>
<div class="outline-text-2" id="text-org8f6903a">
<p>
In this lecture we analyze Dutch healthcare data from <a href="https://www.vektis.nl/open-data">Vektis</a> using <code>pandas</code>, <code>matplotlib</code> and <code>pymc3</code>.
</p>
</div>

<div id="outline-container-org629aa20" class="outline-3">
<h3 id="org629aa20">getting the data ready</h3>
<div class="outline-text-3" id="text-org629aa20">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/X6XNd2NaBpg" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>importing data directly from the web using <code>urllib;</code>
<ul class="org-ul">
<li>see subsection <a href="#upload_data_on_the_university_server">upload data on the university server</a> below to see how to get your data on the university server when using JupyterLab;</li>
</ul></li>
<li>how to read in a csv file as a dataframe using <code>pd.read_csv()</code>;</li>
<li>how to rename columns in a pandas' dataframe using a dictionary;</li>
<li>how create a new column/variable which equals the sum of a list of columns;</li>
<li>using <code>axis</code> to specify whether an action is supposed to be applied across rows (<code>axis=0</code>) or columns (<code>axis=1</code>);</li>
<li>using <code>df.replace()</code> to replace values in a dataframe, again using a dictionary;</li>
<li>change the type of a column/variable using <code>.astype();</code>
<ul class="org-ul">
<li>depending on the versions of the packages you are using <code>df['age'].astype(int)</code> can give an error</li>
<li>if this happens, use <code>df['age'].astype("Float64").astype(int)</code> instead;</li>
</ul></li>
<li>using <code>numpy</code> functions on columns;</li>
<li>using a <code>groupby</code> to aggregate data to the level specified by the list of columns in the groupby
<ul class="org-ul">
<li>in the video we aggregate to age/gender categories, aggregating over postal-code observations.</li>
</ul></li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>what is the average expenditure (not log expenditure) across ages and postal codes for men and women?</li>
<li>what is the average expenditure per age category (across gender and postal codes)?</li>
</ul>
</div>
</div>
