org-files/pagescreencasts.org
** plot and model

This screencast is not meant as an introduction into Bayesian analysis and ~pymc3~. It just shows that this can be done in Python. The notebook gives a bit more detail and some references in case the video "wets your appetite".

[[yt:xfWdNgC6ckw]]

Topics we cover in this video:
+ plot average log expenditure across age for both women and men;
+ create a simple Bayesian model of age-fixed effects using ~pymc3~;
+ sample from the posterior distribution of the model;
+ plot predicted and observed expenditures for women against age.


Questions you should be able to answer:
+ plot average expenditure (averaged across gender) against age;
+ do the ~pymc3~ model for men instead of women.

** upload data on the university server
   :PROPERTIES:
   :CUSTOM_ID:       upload_data_on_the_university_server
   :END:

In the screencast above we downloaded the data directly using ~urllib.request.retrieve()~. The screencast below shows how to this "by hand" to get the data in university server environment.

[[yt:o-j86QStDWg]]

Topics we cover in this video:
+ download data from a website to a local folder on your computer;
+ upload from this folder to the university server;
+ create a new folder ~data~ on the university server.

Questions you should be able to answer:
+ upload the data set for 2011 on the university server. 
