pagescreencasts.html

<div id="outline-container-org714862c" class="outline-3">
<h3 id="org714862c">plot and model</h3>
<div class="outline-text-3" id="text-org714862c">
<p>
This screencast is not meant as an introduction into Bayesian analysis and <code>pymc3</code>. It just shows that this can be done in Python. The notebook gives a bit more detail and some references in case the video "wets your appetite".
</p>

<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/xfWdNgC6ckw" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>plot average log expenditure across age for both women and men;</li>
<li>create a simple Bayesian model of age-fixed effects using <code>pymc3</code>;</li>
<li>sample from the posterior distribution of the model;</li>
<li>plot predicted and observed expenditures for women against age.</li>
</ul>


<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>plot average expenditure (averaged across gender) against age;</li>
<li>do the <code>pymc3</code> model for men instead of women.</li>
</ul>
</div>
</div>

<div id="outline-container-upload_data_on_the_university_server" class="outline-3">
<h3 id="upload_data_on_the_university_server">upload data on the university server</h3>
<div class="outline-text-3" id="text-upload_data_on_the_university_server">
<p>
In the screencast above we downloaded the data directly using <code>urllib.request.retrieve()</code>. The screencast below shows how to this "by hand" to get the data in university server environment.
</p>

<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/o-j86QStDWg" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>download data from a website to a local folder on your computer;</li>
<li>upload from this folder to the university server;</li>
<li>create a new folder <code>data</code> on the university server.</li>
</ul>

<p>
Questions you should be able to answer:
</p>
<ul class="org-ul">
<li>upload the data set for 2011 on the university server.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
</div>
</body>
</html>
